Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs-examples</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.this["github-mgmt"] will be updated in-place
  ~ resource "github_repository" "this" {
        id                     = "github-mgmt"
        name                   = "github-mgmt"
      ~ topics                 = [
          + "ipdx",
        ]
        # (26 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # github_repository_file.this["github-mgmt/CODEOWNERS"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "master"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "chore: Update CODEOWNERS [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # The ipdx team is responsible for GitHub Management maintenance
            * @ipfs-examples/ipdx
            # The github-mgmt stewards team is responsible for triaging/reviewing configuration change requests
            # The ipdx team is added here temporarily to witness use patterns in github-mgmt
            /github/ipfs-examples.yml @ipfs-examples/github-mgmt-stewards @ipfs-examples/ipdx
        EOT
      + file                = "CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "github-mgmt"
      + sha                 = (known after apply)
    }

  # github_team.this["github-mgmt stewards"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + description               = "Users that are effectively org admins"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "github-mgmt stewards"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.this["ipdx"] will be created
  + resource "github_team" "this" {
      + create_default_maintainer = false
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "ipdx"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.this["github-mgmt stewards:2color"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "2color"
    }

  # github_team_membership.this["ipdx:galargh"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "galargh"
    }

  # github_team_repository.this["github-mgmt stewards:github-mgmt"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "github-mgmt"
      + team_id    = (known after apply)
    }

  # github_team_repository.this["ipdx:github-mgmt"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "github-mgmt"
      + team_id    = (known after apply)
    }

Plan: 7 to add, 1 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->